#+SETUPFILE: ~/bin/git/org-html-themes/setup/theme-readtheorg.setup
#+HTML_HEAD: <style> div[class^='outline'] {margin-top:25px; margin-bottom:15px;}</style>
** nfldb
Load database with passing yards for the 2015 regular season with nfldb

#+BEGIN_SRC ipython :session :results none
  df = pd.read_csv('out.csv', index_col=0)
  num_teams = len(df.i_home.drop_duplicates())
  teams = pd.read_csv('teams.csv', index_col=0)
#+END_SRC

#+BEGIN_SRC ipython :session :exports both
  g = df.groupby('away_team')
  away_yds = g.away_yds.sum() # log of mean scores when away
  g = df.groupby('home_team')
  home_yds = g.home_yds.sum() # log of mean scores when away
  tot_yds = away_yds + home_yds
  tot_yds.sort_values(inplace=True)
  tot_yds
#+END_SRC

#+RESULTS:
#+begin_example
away_team
STL    2931
MIN    3246
KC     3493
BUF    3600
SF     3646
DAL    3677
GB     3825
CHI    3843
CAR    3873
TEN    3893
IND    3928
TB     4044
SEA    4059
HOU    4079
CIN    4104
OAK    4129
CLE    4156
NYJ    4170
DEN    4216
MIA    4233
WAS    4294
PHI    4341
JAC    4428
BAL    4462
DET    4463
NYG    4515
ATL    4602
ARI    4775
NE     4812
PIT    4817
SD     4856
NO     5213
dtype: int64
#+end_example

